Revit 2024 API
BuiltInFailures.CopyPasteFailures.NoSketchPlane Property
 Can't paste because no Work Plane is defined in the View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoSketchPlane { get; }
Visual Basic
Public Shared ReadOnly Property NoSketchPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoSketchPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace